{"inkVersion":21,"root":[[["^\"It seems like you both have very different perspectives on your relationship, but it’s clear there’s love here, even amidst the tension.” ","#","^speaker:Therapist ","/#","#","^pigeon:PeggyP1 ","/#","#","^rat:RockyP1","/#","\n",["^“Rocky, you’re under a lot of pressure from your family, trying to provide for your community, and balancing that with your feelings for Peggy.”  ","#","^speaker:Therapist","/#","\n",["^\"Peggy, you’re feeling neglected, not just by Rocky’s absence but by the differences in your worlds. You come from a life of privilege, and it’s hard for you to reconcile that with the life Rocky is leading. But that doesn’t mean your struggles aren’t real.\" ","#","^speaker:Therapist","/#","\n",["^\"You’ve had to adjust to a world that doesn’t always feel safe for you. That’s a heavy thing to carry, isn’t it?\" ","#","^speaker:Therapist","/#","\n",["^\"Yeah… I mean, where I live, I have to be careful all the time. Dodging people, watching for stray dogs, making sure I’m not caught somewhere I can’t fly out of.\" ","#","^speaker:Peggy  ","/#","#","^pigeon:PeggyP3","/#","\n",["^\"It’s exhausting. I’m always looking over my shoulder, always trying to figure out if I’m about to be someone’s problem just because I exist in their space.\" ","#","^speaker:Peggy","/#","\n",["^\"So… when you say I was never there with you… you don’t just mean you wanted company all of the time.\" ","#","^speaker:Rocky  ","/#","#","^pigeon:PeggyP1 ","/#","#","^rat:RockyP7","/#","\n",["^\"You wanted me there to protect you… because you felt scared.\" ","#","^speaker:Rocky","/#","\n",["^\"I didn’t always feel safe. And I don’t think I wanted to admit that.\" ","#","^speaker:Peggy  ","/#","#","^pigeon:PeggyP3","/#","\n",["^\"I thought providing for you meant… making sure you had food, a place to rest, things you needed. I thought that was enough.\" ","#","^speaker:Rocky  ","/#","#","^pigeon:PeggyP1 ","/#","#","^rat:RockyP3","/#","\n",["^\"But I wasn’t there. Not really.\" ","#","^speaker:Rocky ","/#","#","^pigeon:PeggyP1 ","/#","#","^rat:RockyP1","/#","\n",["^\"I don’t want you to feel like that. Like you’re alone in it.\" ","#","^speaker:Rocky ","/#","#","^pigeon:PeggyP4 ","/#","#","^rat:RockyP6","/#","\n",["^\"See what happens when you hear each other? That’s the power of slowing down and taking the time to understand.\" ","#","^speaker:Therapist","/#","\n",["^\"But ultimately, the question remains: do you think you can keep building this relationship, or do you feel it might be time to go your separate ways?\" ","#","^speaker:Therapist ","/#","#","^pigeon:PeggyP4 ","/#","#","^rat:RockyP4","/#","\n",["^the end?","\n",["done",{"#f":5,"#n":"g-15"}],{"#f":5,"#n":"g-14"}],{"#f":5,"#n":"g-13"}],{"#f":5,"#n":"g-12"}],{"#f":5,"#n":"g-11"}],{"#f":5,"#n":"g-10"}],{"#f":5,"#n":"g-9"}],{"#f":5,"#n":"g-8"}],{"#f":5,"#n":"g-7"}],{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}